app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."slug" = 'music' LIMIT 1
---
	def show
		@category = Category.find_by(slug: params[:id])

INSERT INTO "categories" ("created_at", "name", "slug", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 28 Nov 2017 11:36:38 UTC +00:00], ["name", "bogus"], ["slug", "bogus"], ["updated_at", Tue, 28 Nov 2017 11:36:38 UTC +00:00]]
---
	def create
		@category = Category.new(params.require(:category).permit(:name))

		if @category.save