app/controllers/comments_controller.rb

	def create
		@post = Post.find(params[:post_id])

		# @comment = Comment.new(params.require(:comment).permit(:body))
		# @comment.post = @post
		# above two lines can be condensed to below:
		@comment = @post.comments.build(params.require(:comment).permit(:body))
		@comment.creator = current_user # must exist because before_action :require_user

		if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 8]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "Another comment la"], ["created_at", Thu, 16 Nov 2017 07:13:42 UTC +00:00], ["post_id", 1], ["updated_at", Thu, 16 Nov 2017 07:13:42 UTC +00:00], ["user_id", 1]]

	def vote
		# binding.pry
		comment = Comment.find(params[:id])
		vote = Vote.create(voteable: comment, creator: current_user, vote: params[:vote])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "7"]]
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Mon, 27 Nov 2017 10:05:46 UTC +00:00], ["updated_at", Mon, 27 Nov 2017 10:05:46 UTC +00:00], ["user_id", 1], ["vote", true], ["voteable_id", 7], ["voteable_type", "Comment"]]