app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'last-post-2' LIMIT 1
---
	def create
		@post = Post.find_by(slug: params[:post_id])