app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
  	@posts = Post.all.sort_by{|x| x.total_votes}.reverse

INSERT INTO "posts" ("created_at", "title", "updated_at", "url") VALUES (?, ?, ?, ?)  [["created_at", Tue, 14 Nov 2017 06:05:32 UTC +00:00], ["title", "Tuesday Post"], ["updated_at", Tue, 14 Nov 2017 06:05:32 UTC +00:00], ["url", ""]]
---
  def create

  	# Post.create(title: params[:my_title]).  # we could do this with HTML forms
  	@post = Post.new(post_params) # post_params is defined in private below

  	@post.creator = current_user # current user must excist because of before_action :require_user

  	if @post.save

UPDATE "posts" SET "title" = ?, "slug" = ?, "updated_at" = ? WHERE "posts"."id" = 10  [["title", "Last Post.2"], ["slug", "last-post-2"], ["updated_at", Wed, 29 Nov 2017 05:50:51 UTC +00:00]]
---
  def update
  	if @post.update(post_params)

INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Mon, 27 Nov 2017 09:21:01 UTC +00:00], ["updated_at", Mon, 27 Nov 2017 09:21:01 UTC +00:00], ["user_id", 1], ["vote", true], ["voteable_id", 1], ["voteable_type", "Post"]]
---
	def vote
		# @vote needs to be an instance variable so it flows to templates
		@vote = Vote.create(voteable: @post, creator: current_user, vote: params[:vote])

SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'second-post' LIMIT 1
---
  def set_post
		@post = Post.find_by(slug: params[:id])