app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username") VALUES (?, ?, ?)  [["created_at", Mon, 27 Nov 2017 04:11:46 UTC +00:00], ["updated_at", Mon, 27 Nov 2017 04:11:46 UTC +00:00], ["username", "Bob"]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "time_zone" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["time_zone", "Georgetown"], ["updated_at", Sun, 03 Dec 2017 15:40:35 HKT +08:00]]

  def set_user
    @user = User.find_by(slug: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."slug" = 'daniel-' LIMIT 1